robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA.cpp
/*
 Talks to SMA Sunny Boy, Model SB 8000US-12
    - Gets AC power (only)
    - Sends the result to a custom LED bargraph

  Based on code found at https://github.com/stuartpittaway/nanodesmapvmonitor
 */

//Need to change SoftwareSerial/NewSoftSerial.h file to set buffer to 128 bytes or you will get buffer overruns!
//Find the line below and change
//#define _NewSS_MAX_RX_BUFF 128 // RX buffer size

#include "Arduino.h"
#include "ESP32_SMA.h"

#include "time.h"
#include "bluetooth.h"
#include "LocalUtil.h"
#include "mainstate.h"

#include <WiFi.h>
#include <WiFiClient.h>
#include <WebServer.h>
#include <Update.h>
#include "site_details.h"

#include "EspMQTTClient.h"

#include <logging.hpp>
#include <ets-appender.hpp>
#include <udp-appender.hpp>
#include "ESP32_SMA_Inverter.h"
#ifdef ARDUINO_ARCH_ESP32
#include "esp_sntp.h"
#endif

// Track if we've aligned ESP32rtc to SNTP time to avoid repeated adjustments
static bool gRtcAligned = false;
static unsigned long gBtEarliestStartMs = 0;


using namespace esp32m;


#ifdef SLEEP_ROUTINE
ESP32Time wakeupTime;
ESP32Time bedTime;
#endif
//#define WAKEUP_TIME 22,30 
//#define BED_TIME 05,45

#ifdef SYSLOG_HOST
#ifdef SYSLOG_PORT
  UDPAppender udpappender(SYSLOG_HOST, SYSLOG_PORT);
#else
  UDPAppender udpappender(SYSLOG_HOST, 514);
#endif
#endif


//BST Start and end dates - this needs moving into some sort of PROGMEM array for the years or calculated based on the BST logic see
//http://www.time.org.uk/bstgmtcodepage1.aspx
//static time_t SummerStart=1435888800;  //Sunday, 31 March 02:00:00 GMT
//static time_t SummerEnd=1425952800;  //Sunday, 27 October 02:00:00 GMT


size_t xArraySize(void);


void ESP32_SMA::blinkLed()
{
  digitalWrite(LED_BUILTIN, blinklaststate);
  blinklaststate = !blinklaststate;
}

void ESP32_SMA::blinkLedOff()
{
  if (blinklaststate)
  {
    blinkLed();
  }
}


ESP32_SMA esp32sma ;

void onConnectionEstablished() {
  esp32sma.onConnectionEstablished();
}

void ESP32_SMA::onConnectionEstablished()
{
  mqttclient.publish(MQTT_BASE_TOPIC "LWT", "online", true);
  // Publish inverter serial
  char invSerial[18];
  sprintf(invSerial, "%02X:%02X:%02X:%02X:%02X:%02X", smaBTInverterAddressArray[5], smaBTInverterAddressArray[4], smaBTInverterAddressArray[3], smaBTInverterAddressArray[2], smaBTInverterAddressArray[1], smaBTInverterAddressArray[0]);
  mqttclient.publish(MQTT_BASE_TOPIC "inv_serial", invSerial, true);
  logW("WiFi and MQTT connected");
  logW("v1 Build 2w d (%s) t (%s) "  ,__DATE__ , __TIME__) ;

#ifdef PUBLISH_HASS_TOPICS
  // client.publish(MQTT_BASE_TOPIC "LWT", "online", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/signal/config", "{\"name\": \"" FRIENDLY_NAME " Signal Strength\", \"state_topic\": \"" MQTT_BASE_TOPIC "signal\", \"unique_id\": \"" HOST "-signal\", \"unit_of_measurement\": \"dB\", \"device\": {\"identifiers\": [\"" HOST "-device\"], \"name\": \"" FRIENDLY_NAME "\"}}", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/generation_today/config", "{\"name\": \"" FRIENDLY_NAME " Power Generation Today\", \"device_class\": \"energy\", \"state_topic\": \"" MQTT_BASE_TOPIC "generation_today\", \"unique_id\": \"" HOST "-generation_today\", \"unit_of_measurement\": \"Wh\", \"state_class\": \"total_increasing\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/generation_total/config", "{\"name\": \"" FRIENDLY_NAME " Power Generation Total\", \"device_class\": \"energy\", \"state_topic\": \"" MQTT_BASE_TOPIC "generation_total\", \"unique_id\": \"" HOST "-generation_total\", \"unit_of_measurement\": \"Wh\", \"state_class\": \"total_increasing\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_ac/config", "{\"name\": \"" FRIENDLY_NAME " Instantinous AC Power\", \"device_class\": \"energy\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_ac\", \"unique_id\": \"" HOST "-instant_ac\", \"unit_of_measurement\": \"W\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_dc/config", "{\"name\": \"" FRIENDLY_NAME " Instantinous DC Power\", \"device_class\": \"energy\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_dc\", \"unique_id\": \"" HOST "-instant_dc\", \"unit_of_measurement\": \"W\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_vdc/config", "{\"name\": \"" FRIENDLY_NAME " Instantinous DC Voltage\", \"device_class\": \"energy\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_vdc\", \"unique_id\": \"" HOST "-instant_vdc\", \"unit_of_measurement\": \"V\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_adc/config", "{\"name\": \"" FRIENDLY_NAME " Instantinous DC Ampere\", \"device_class\": \"energy\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_adc\", \"unique_id\": \"" HOST "-instant_adc\", \"unit_of_measurement\": \"A\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  // Per-string metrics if available
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_vdc1/config", "{\"name\": \"" FRIENDLY_NAME " DC Voltage 1\", \"device_class\": \"voltage\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_vdc1\", \"unique_id\": \"" HOST "-instant_vdc1\", \"unit_of_measurement\": \"V\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_vdc2/config", "{\"name\": \"" FRIENDLY_NAME " DC Voltage 2\", \"device_class\": \"voltage\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_vdc2\", \"unique_id\": \"" HOST "-instant_vdc2\", \"unit_of_measurement\": \"V\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_adc1/config", "{\"name\": \"" FRIENDLY_NAME " DC Current 1\", \"device_class\": \"current\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_adc1\", \"unique_id\": \"" HOST "-instant_adc1\", \"unit_of_measurement\": \"A\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_adc2/config", "{\"name\": \"" FRIENDLY_NAME " DC Current 2\", \"device_class\": \"current\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_adc2\", \"unique_id\": \"" HOST "-instant_adc2\", \"unit_of_measurement\": \"A\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_pdc1/config", "{\"name\": \"" FRIENDLY_NAME " DC Power 1\", \"device_class\": \"power\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_pdc1\", \"unique_id\": \"" HOST "-instant_pdc1\", \"unit_of_measurement\": \"W\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/instant_pdc2/config", "{\"name\": \"" FRIENDLY_NAME " DC Power 2\", \"device_class\": \"power\", \"state_topic\": \"" MQTT_BASE_TOPIC "instant_pdc2\", \"unique_id\": \"" HOST "-instant_pdc2\", \"unit_of_measurement\": \"W\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/grid_frequency/config", "{\"name\": \"" FRIENDLY_NAME " Grid Frequency\", \"device_class\": \"frequency\", \"state_topic\": \"" MQTT_BASE_TOPIC "grid_frequency\", \"unique_id\": \"" HOST "-grid_frequency\", \"unit_of_measurement\": \"Hz\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/grid_voltage/config", "{\"name\": \"" FRIENDLY_NAME " Grid Voltage\", \"device_class\": \"voltage\", \"state_topic\": \"" MQTT_BASE_TOPIC "grid_voltage\", \"unique_id\": \"" HOST "-grid_voltage\", \"unit_of_measurement\": \"V\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/inverter_temp/config", "{\"name\": \"" FRIENDLY_NAME " Inverter Temperature\", \"device_class\": \"temperature\", \"state_topic\": \"" MQTT_BASE_TOPIC "inverter_temp\", \"unique_id\": \"" HOST "-inverter_temp\", \"unit_of_measurement\": \"°C\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/max_power_today/config", "{\"name\": \"" FRIENDLY_NAME " Max Power Today\", \"device_class\": \"power\", \"state_topic\": \"" MQTT_BASE_TOPIC "max_power_today\", \"unique_id\": \"" HOST "-max_power_today\", \"unit_of_measurement\": \"W\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  
  // Extended metrics auto-discovery
  mqttclient.publish("homeassistant/sensor/" HOST "/ac_voltage/config", "{\"name\": \"" FRIENDLY_NAME " AC Voltage\", \"device_class\": \"voltage\", \"state_topic\": \"" MQTT_BASE_TOPIC "ac_voltage\", \"unique_id\": \"" HOST "-ac_voltage\", \"unit_of_measurement\": \"V\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/ac_current/config", "{\"name\": \"" FRIENDLY_NAME " AC Current\", \"device_class\": \"current\", \"state_topic\": \"" MQTT_BASE_TOPIC "ac_current\", \"unique_id\": \"" HOST "-ac_current\", \"unit_of_measurement\": \"A\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/operating_time/config", "{\"name\": \"" FRIENDLY_NAME " Operating Time\", \"device_class\": \"duration\", \"state_topic\": \"" MQTT_BASE_TOPIC "operating_time\", \"unique_id\": \"" HOST "-operating_time\", \"unit_of_measurement\": \"h\", \"state_class\": \"total_increasing\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/feedin_time/config", "{\"name\": \"" FRIENDLY_NAME " Feed-in Time\", \"device_class\": \"duration\", \"state_topic\": \"" MQTT_BASE_TOPIC "feedin_time\", \"unique_id\": \"" HOST "-feedin_time\", \"unit_of_measurement\": \"h\", \"state_class\": \"total_increasing\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/device_status/config", "{\"name\": \"" FRIENDLY_NAME " Device Status\", \"state_topic\": \"" MQTT_BASE_TOPIC "device_status\", \"unique_id\": \"" HOST "-device_status\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/device_status_code/config", "{\"name\": \"" FRIENDLY_NAME " Device Status Code\", \"state_topic\": \"" MQTT_BASE_TOPIC "device_status_code\", \"unique_id\": \"" HOST "-device_status_code\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  // New topics to match SBFspot
  mqttclient.publish("homeassistant/sensor/" HOST "/inv_serial/config", "{\"name\": \"" FRIENDLY_NAME " Inverter Serial\", \"state_topic\": \"" MQTT_BASE_TOPIC "inv_serial\", \"unique_id\": \"" HOST "-inv_serial\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/inv_time/config", "{\"name\": \"" FRIENDLY_NAME " Inverter Time\", \"state_topic\": \"" MQTT_BASE_TOPIC "inv_time\", \"unique_id\": \"" HOST "-inv_time\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
#ifdef THREE_PHASE
  mqttclient.publish("homeassistant/sensor/" HOST "/uac2/config", "{\"name\": \"" FRIENDLY_NAME " Grid Voltage L2\", \"device_class\": \"voltage\", \"state_topic\": \"" MQTT_BASE_TOPIC "uac2\", \"unique_id\": \"" HOST "-uac2\", \"unit_of_measurement\": \"V\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/uac3/config", "{\"name\": \"" FRIENDLY_NAME " Grid Voltage L3\", \"device_class\": \"voltage\", \"state_topic\": \"" MQTT_BASE_TOPIC "uac3\", \"unique_id\": \"" HOST "-uac3\", \"unit_of_measurement\": \"V\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/iac2/config", "{\"name\": \"" FRIENDLY_NAME " AC Current L2\", \"device_class\": \"current\", \"state_topic\": \"" MQTT_BASE_TOPIC "iac2\", \"unique_id\": \"" HOST "-iac2\", \"unit_of_measurement\": \"A\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/iac3/config", "{\"name\": \"" FRIENDLY_NAME " AC Current L3\", \"device_class\": \"current\", \"state_topic\": \"" MQTT_BASE_TOPIC "iac3\", \"unique_id\": \"" HOST "-iac3\", \"unit_of_measurement\": \"A\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/pac2/config", "{\"name\": \"" FRIENDLY_NAME " AC Power L2\", \"device_class\": \"power\", \"state_topic\": \"" MQTT_BASE_TOPIC "pac2\", \"unique_id\": \"" HOST "-pac2\", \"unit_of_measurement\": \"W\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
  mqttclient.publish("homeassistant/sensor/" HOST "/pac3/config", "{\"name\": \"" FRIENDLY_NAME " AC Power L3\", \"device_class\": \"power\", \"state_topic\": \"" MQTT_BASE_TOPIC "pac3\", \"unique_id\": \"" HOST "-pac3\", \"unit_of_measurement\": \"W\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);
#endif
  mqttclient.publish("homeassistant/sensor/" HOST "/pac1/config", "{\"name\": \"" FRIENDLY_NAME " AC Power L1\", \"device_class\": \"power\", \"state_topic\": \"" MQTT_BASE_TOPIC "pac1\", \"unique_id\": \"" HOST "-pac1\", \"unit_of_measurement\": \"W\", \"state_class\": \"measurement\", \"device\": {\"identifiers\": [\"" HOST "-device\"]} }", true);

