robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA.cpp
#endif // PUBLISH_HASS_TOPICS
}

void setup() {
  esp32sma.setup();
}

void ESP32_SMA::setup()
{
  Serial.begin(115200);                      //Serial port for debugging output

  Logging::setLevel(esp32m::Info);
  Logging::addAppender(&ETSAppender::instance());
#ifdef SYSLOG_HOST
  udpappender.setMode(UDPAppender::Format::Syslog);
  Logging::addAppender(&udpappender);
#endif
  Serial.println("added appenders");

  // Start WiFi first with modem sleep enabled (required for WiFi+BT), then start Classic BT

  // Ensure WiFi is in station mode and has a friendly hostname before connecting
  WiFi.mode(WIFI_STA);
#ifdef HOST
  WiFi.setHostname(HOST);
#endif
  // When WiFi and Classic BT are both enabled, WiFi modem sleep MUST be enabled
  // to satisfy coexistence requirements in ESP-IDF.
  WiFi.setSleep(true);
  WiFi.persistent(false);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  {
    unsigned long start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < 20000) {
      delay(100);
    }
  }

  // Get the MAC address in reverse order (not sure why, but do it here to make setup easier)
  unsigned char smaSetAddress[6] = {SMA_ADDRESS};
  for (int i = 0; i < 6; i++)
    smaBTInverterAddressArray[i] = smaSetAddress[5 - i];

  pinMode(LED_BUILTIN, OUTPUT);

  ESP32rtc.setTime(30, 24, 15, 17, 1, 2021); // 17th Jan 2021 15:24:30  // Need this to be accurate. Since connecting to the internet anyway, use NTP.

  mqttclient.setMaxPacketSize(512); // must be big enough to send home assistant config
  mqttclient.enableMQTTPersistence();
  mqttclient.enableDebuggingMessages();                                     // Enable debugging messages sent to serial output
  mqttclient.enableHTTPWebUpdater("/update");                               // Enable the web updater. User and password default to values of MQTTUsername and MQTTPassword. These can be overrited with enableHTTPWebUpdater("user", "password").
  mqttclient.enableLastWillMessage(MQTT_BASE_TOPIC "LWT", "offline", true); // You can activate the retain flag by setting the third parameter to true

  logW("Connecting to %s" , WIFI_SSID);
  {
    String ipStr = WiFi.localIP().toString();
    logI("Current IP (if any): %s" , ipStr.c_str());
  }

  // Always set time to GMT timezone
#ifdef ARDUINO_ARCH_ESP32
  // Log DNS for NTP server to spot resolution issues
  {
    IPAddress ip;
    if (WiFi.hostByName(NTP_SERVER, ip)) {
      String sip = ip.toString();
      logI("NTP DNS %s -> %s", NTP_SERVER, sip.c_str());
    } else {
      logW("NTP DNS failed for %s", NTP_SERVER);
    }
  }
  // Notify when SNTP actually synchronizes
  sntp_set_time_sync_notification_cb([](struct timeval *tv){
    time_t now = time(nullptr);
    Serial.printf("SNTP sync event, now=%lu\n", (unsigned long)now);
  });
#endif
  configTime(timeZoneOffset, 0, NTP_SERVER, NTP_SERVER2, NTP_SERVER3);
  if (WiFi.status() == WL_CONNECTED) {
    String ipStr = WiFi.localIP().toString();
    logW("WiFi connected: %s -> %s" , WIFI_SSID, ipStr.c_str());
  } else {
    logW("WiFi not connected yet; MQTT/UDP will start once connected");
  }
  
  Logging::hookUartLogger();
//  setupOTAServer();


  logD("hello world!");

  // Initialize scheduled timers to avoid long initial gaps
  nextSecond = millis() + 1000;
  next5Minute = millis() + 30000; // first 5-min tick after 30s
  nextHour = millis() + 5 * 60 * 1000; // first hour tick after 5 min
  nextDay = millis() + 60 * 60 * 1000; // first day tick after 1 hour
}

void ESP32_SMA::everySecond()
{
  blinkLedOff();
  static uint32_t hb = 0;
  hb++;
  if ((hb % 5) == 0) {
    // Debug heartbeat every 5s
    logI("heartbeat t=%lu rssi=%d", ESP32rtc.getEpoch(), WiFi.RSSI());
    if (mqttclient.isConnected()) {
      time_t now = ESP32rtc.getEpoch();
      struct tm tm_utc;
      gmtime_r(&now, &tm_utc);
      char ts[25];
      strftime(ts, sizeof(ts), "%Y-%m-%dT%H:%M:%SZ", &tm_utc);
      mqttclient.publish(MQTT_BASE_TOPIC "esp_local_utc_time", ts, false);
      mqttclient.publish(MQTT_BASE_TOPIC "heartbeat", "1", false);
    }
  }
}

void ESP32_SMA::every5Minutes()
{
  log_d("every5Minutes()");
  if (mqttclient.isConnected())
  {
    mqttclient.publish(MQTT_BASE_TOPIC "signal", String(WiFi.RSSI()));
  }
}

void ESP32_SMA::everyHour()
{

}

void ESP32_SMA::everyDay()
{

}


void ESP32_SMA::dodelay(unsigned long duration)
{
  sleepuntil = millis() + duration;
}

//uint8_t mainstate = MAINSTATE_INIT;
MainState mainstate = MAINSTATE_INIT;

static long lastRanTime = 0;
static long nowTime = 0;

void loop() {
  esp32sma.loop();
}


void ESP32_SMA::loop()
{
  struct tm timeinfo;
  mqttclient.loop();
  // server.handleClient();
  // If WiFi isn't up yet, don't start/hammer Bluetooth. Give WiFi/MQTT time to connect.
  if (WiFi.status() != WL_CONNECTED) {
    static unsigned long lastLog = 0;
    if (millis() - lastLog > 3000) {
      lastLog = millis();
      logI("Waiting for WiFi... status=%d", (int)WiFi.status());
    }
    dodelay(500);
    return;
  }
  
  if (millis() >= nextSecond)
  {
    nextSecond = millis() + 1000;
    everySecond();
  }

  if (millis() >= next5Minute)
  {
    next5Minute = millis() + 1000 * 60 * 5;
    every5Minutes();
  }

  if (millis() >= nextHour)
  {
    nextHour = millis() + 1000 * 3600;
    everyHour();
  }

  if (millis() >= nextDay)
  {
    nextDay = millis() + 1000 * 3600 * 24 ;
    everyDay();
  }

  // "delay" the main BT loop
  if (millis() < sleepuntil)
    return;

  // if in the main loop, only run at the top of the minute
  // if (mainstate >= MAINSTATE_GET_INSTANT_AC_POWER)
  // {
  //   getLocalTime(&timeinfo);
  //   if (timeinfo.tm_min == thisminute)
  //     return;
  // }

  // If SNTP has set the system clock, align ESP32rtc once
  {
    time_t now = time(nullptr);
    if (!gRtcAligned && now > 1609459200) { // > 2021-01-01
      ESP32rtc.setTime(now);
      gRtcAligned = true;
      logI("RTC aligned to SNTP: %lu", (unsigned long)now);
      // Allow a short grace period before starting Classic BT to avoid coex timing issues
      gBtEarliestStartMs = millis() + 3000;
    }
  }

  // Wait for initial NTP sync before setting up inverter
  // Prefer the SNTP sync status when available; fall back to a time threshold heuristic.
  {
    time_t now = time(nullptr);
#ifdef ARDUINO_ARCH_ESP32
    bool synced = (sntp_get_sync_status() == SNTP_SYNC_STATUS_COMPLETED) || (now > 1640995200);
#else
    bool synced = (now > 1640995200);
#endif
    if (mainstate == MAINSTATE_INIT && !synced)
  {
    // Avoid re-calling configTime in loop; SNTP is already configured in setup().
    log_d("NTP not yet sync'd, sleeping");
    log_w("NTP not yet sync'd, sleeping 10s");
    dodelay(10000);
    return;
  }
  }

  // Keep BT work within the state machine; avoid extra pre-connection loop that could starve WiFi
  blinkLed();

  // Guard: defer first BT start slightly after SNTP sync to reduce coex failures
  if (mainstate == MAINSTATE_INIT && gBtEarliestStartMs != 0 && millis() < gBtEarliestStartMs) {
    dodelay(1000);
    return;
  }

