robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA.cpp
  // BT-link watchdog. Once we're past initial pairing/login the state machine
  // assumes BT is up. If the link silently dies (charTime stops advancing for
  // STALE_BT_THRESHOLD_MS) the per-function timeouts just chain forever and
  // the device sits dead until the user power-cycles. Force a full BT
  // re-pair: tear down the stack and bounce back to MAINSTATE_INIT.
  {
    const unsigned long STALE_BT_THRESHOLD_MS = 30000UL;
    if (mainstate >= MAINSTATE_INIT_SMA_CONNECTION
        && gLastBTSuccessMs != 0
        && (millis() - gLastBTSuccessMs) > STALE_BT_THRESHOLD_MS) {
      logW("BT link stale for %lus, forcing full reconnect (mainstate=%s)",
           (millis() - gLastBTSuccessMs) / 1000UL,
           mainstate.toString().c_str());
      btReset();
      mainstate = MAINSTATE_INIT;
      smaInverter.resetInnerstate();
      gLastBTSuccessMs = millis(); // suppress immediate re-trigger
      gBtEarliestStartMs = millis() + 3000;
      dodelay(1000);
      return;
    }
  }

  log_d("Loop mainstate: %s", mainstate.toString().c_str());

  switch (mainstate)
  {
  case MAINSTATE_INIT:
    if (BTStart())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    else
    {
      // Backoff more before retrying BT bring-up to avoid coex issues
      dodelay(2000);
    }
    break;

  case MAINSTATE_INIT_SMA_CONNECTION:
    if (smaInverter.initialiseSMAConnection())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_LOGON_SMA_INVERTER:
    if (smaInverter.logonSMAInverter())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_DAILY_YIELD_3 : //3
    // Doing this to set datetime
    if (smaInverter.getDailyYield())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_CHECK_SET_INVERTER_TIME: // 4:
    if (smaInverter.checkIfNeedToSetInverterTime())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

    // --------- regular loop -----------------

  case MAINSTATE_GET_INSTANT_AC_POWER:// 5:
    if (smaInverter.getInstantACPower())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    } 
    break;

  case MAINSTATE_GET_INSTANT_DC_POWER: //6:
    if (smaInverter.getInstantDCPower())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    } 
    break;

  case MAINSTATE_GET_DAILY_YIELD_7:// 7:
    if (smaInverter.getDailyYield())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_TOTAL_POWER_GENERATION: //8:
    if (smaInverter.getTotalPowerGeneration())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_GRID_FREQUENCY: //9:
    if (smaInverter.getGridFrequency())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_GRID_VOLTAGE: //10:
    if (smaInverter.getGridVoltage())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_INVERTER_TEMPERATURE: //11:
    if (smaInverter.getInverterTemperature())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_MAX_POWER_TODAY: //12:
    if (smaInverter.getMaxPowerToday())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_AC_VOLTAGE: //13:
    if (smaInverter.getACVoltage())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_AC_CURRENT: //14:
    if (smaInverter.getACCurrent())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_OPERATING_TIME: //15:
    if (smaInverter.getOperatingTime())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_FEEDIN_TIME: //16:
    if (smaInverter.getFeedInTime())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_GET_DEVICE_STATUS: //17:
    if (smaInverter.getDeviceStatus())
    {
      mainstate++;
      smaInverter.resetInnerstate();
    }
    break;

  case MAINSTATE_DISCONNECT: //18:
    // SBFspot pattern: close the BT session at the end of every poll cycle.
    // Long-lived sessions accumulate BT-stack staleness (we were seeing
    // ~3-4 BT timeouts/min). disconnectAndLogoff() sends the SMA logoff
    // command, tears down the stack, and resets packet counters; the next
    // cycle re-enters MAINSTATE_INIT and does a fresh connect+login.
    smaInverter.disconnectAndLogoff();
    smaInverter.resetInnerstate();
    mainstate = MAINSTATE_INIT;
    // Suppress the watchdog during the gap - we're intentionally idle.
    gLastBTSuccessMs = millis();
    gBtEarliestStartMs = millis() + 1000;
    dodelay(METRIC_UPDATE_MS);
    break;

  default:
    mainstate = MAINSTATE_GET_INSTANT_AC_POWER;
    smaInverter.resetInnerstate();
  dodelay(METRIC_UPDATE_MS); // cadence between metric cycles
  }
  return;

  //getInverterName();
  //HistoricData();
  lastRanTime = millis() - 4000;
  log_i("While...");

  while (1)
  {

    //HowMuchMemory();

    //Populate datetime and spotpowerac variables with latest values
    //getInstantDCPower();
    nowTime = millis();
    if (nowTime > (lastRanTime + 4000))
    {
      lastRanTime = nowTime;
      Serial.print("^");
      smaInverter.getInstantACPower();
    }

    //digitalClockDisplay(now());

    //The inverter always runs in UTC time (and so does this program!), and ignores summer time, so fix that here...
    //add 1 hour to readings if its summer
    // DRH Temp removal of: if ((datetime>=SummerStart) && (datetime<=SummerEnd)) datetime+=60*60;

#ifdef SLEEP_ROUTINE

 //wakeupTime;
 //bedTime;
#endif



#ifdef allowsleep
    if ((ESP32rtc.getEpoch() > (datetime + 3600)) && (spotpowerac == 0))
    {
      //Inverter output hasnt changed for an hour, so put Nanode to sleep till the morning
      //debugMsgln("Bed time");

      //sleeping=true;

      //Get midnight on the day of last solar generation
      // First, create a time structure to hold the answer to "At what time (in time_t seconds) is the upcoming midnight?"
      tmElements_t tm;
      tm.Year = year(datetime) - 1970;
      tm.Month = month(datetime);
      tm.Day = day(datetime);
      tm.Hour = 23;
      tm.Hour = hour(datetime);
      tm.Minute = 59;
      tm.Second = 59;
      time_t midnight = makeTime(tm);

      //Move to midnight
      //debugMsg("Midnight ");digitalClockDisplay( midnight );debugMsgln("");

      if (ESP32rtc.getEpoch() < midnight)
      {
        //Time to calculate SLEEP time, we only do this if its BEFORE midnight
        //on the day of solar generation, otherwise we might wake up and go back to sleep immediately!

        //Workout what time sunrise is and sleep till then...
        //longitude, latitude (london uk=-0.126236,51.500152)
        unsigned int minutespastmidnight = ComputeSun(mylongitude, mylatitude, datetime, true);

        //We want to wake up at least 15 minutes before sunrise, just in case...
        checktime = midnight + minutespastmidnight - 15 * 60;
      }
    }
#endif

    //digitalClockDisplay( checktime );

    //Delay for approx. 4 seconds between instant AC power readings

  } // end of while(1)
} // end of loop()
